package ru.job4j.condition;
/**
 *В этом задании ваша задача повторить действие описанные выше.
 *
 * 1. Создать собственный тип Point (то есть просто создать class Point), описывающий точку в системе координат
 * 2. Научить этот тип рассчитывать расстоянием между собой и другой точкой.
 * 3. Залить этот класс на github.
 * 4. В папке со своим именем создайте задачу c именем этой задачи.
 * 5. Заполните поле исходный код - укажите там ссылку на коммит к этой задаче.
 * 6. Выполните операцию начать и укажите отвественного Петра Арсентьева.
 * 7. Переходите к следующей задаче.
 *
 */